In [1]:
#import panda dependency
import pandas as pd

In [2]:
#files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
#Read the school data file and store it in a panda dataframe
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [4]:
#read student data file and store it in panda dataframes
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
#determine if there are missing values in schoold data
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
#determine if there are missing values in student data
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
#determine if there are any missing values in school data
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [8]:
#determine if there are any missing values in student data
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [9]:
#determine not null for schools
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [10]:
#determine not null for students
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [11]:
#4.5.3

In [12]:
#determine the data type for the column budget
school_data_df.budget.dtype

dtype('int64')

In [13]:
#determine the data type for the student data
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [14]:
#Clean the students names

#put the student names into a list
student_names = student_data_df["student_name"].tolist()

#creat a new list to hold the students names that have 3+ 'words'
students_to_fix = []

#use an if statement to add names to the list if they have 3+ words
for name in student_names:
    if len(name.split()) >=3:
        students_to_fix.append(name)


#create a list of the prefixes from those students that have 3+ names
#create an empty list to hold the prefixes
prefixes = []

#cycle through the names in the newly created list only and if the first element has more for or less letters, add it to the list
#only add the prefix to the list, not the whole name!
for name in students_to_fix:
    if len(name.split()[0]) <= 4:
        prefixes.append(name.split()[0])

#Do the same thing for suffix
#only look for where there are 3 letters because all the prefixes only have those
suffixes = []

for name in students_to_fix:
    if len(name.split()[-1]) <=3:
        suffixes.append(name.split()[-1])

In [15]:
#print the list of unique prefixes
print(set(prefixes))

{'Sara', 'Chad', 'Anne', 'Ryan', 'Lori', 'Leah', 'Jose', 'Mrs.', 'Kim', 'Paul', 'Lisa', 'Ian', 'Tony', 'Dr.', 'Mr.', 'Lynn', 'Jodi', 'Eric', 'Judy', 'Ruth', 'Mark', 'Kari', 'Gary', 'Sean', 'Dawn', 'Mary', 'Cody', 'Toni', 'Kyle', 'Greg', 'Noah', 'Jon', 'John', 'Tara', 'Anna', 'Amy', 'Gail', 'Seth', 'Miss', 'Carl', 'Kara', 'Cory', 'Luke', 'Mike', 'Marc', 'Troy', 'Jill', 'Adam', 'Gina', 'Dale', 'Emma', 'Erik', 'Omar', 'Ms.', 'Erin', 'Dana', 'Tina', 'Todd', 'Joe'}

In [16]:
#print the list of unique suffixes
print(set(suffixes))

{'V', 'Cox', 'IV', 'DVM', 'Lee', 'Roy', 'Day', 'MD', 'II', 'Kim', 'Li', 'III', 'Jr.', 'DDS', 'PhD'}

In [17]:
#hard code the prefixes and suffixes in based on the list
#add the spaces after the pre and before the suff
pre_suff = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [18]:
#clean the student data to remove the pre and suffix words
for word in pre_suff:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word, "")
    
student_data_df.head(10)

C:\Users\julia\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  This is separate from the ipykernel package so we can avoid doing imports until

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [19]:
#4.7.1 Merge Dataframes
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [20]:
#4.7.2:count the number of students

student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [21]:
#4.7.3: count the number of schools
#count the number of schools with the original data set
school_count = school_data_df["school_name"].count()
print(school_count)

#count the number of schools with the joined data set
school_count2 = len(school_data_complete_df["school_name"].unique())
print(school_count2)

15
15

In [22]:
#4.7.4: get the total budget
#can't calculate the budget on the joined data set - would add budget for each student

#calculate total budget
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [23]:
#4.7.5  Get the average scores
#get the average reading score
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [24]:
#4.7.5  Get the average scores
#get the average math score
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [25]:
#4.7.6 Get the passing percentages
#get the passing grades for math

passing_math = school_data_complete_df[school_data_complete_df["math_score"] >=70]
passing_math_count = passing_math["student_name"].count()

In [26]:
#4.7.6 Get the passing percentages
#get the passing grades for reading

passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >=70]
passing_reading_count = passing_reading["student_name"].count()

In [27]:
#4.7.6: print passing math and reading
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [28]:
# 4.7.6: get % of students who passed reading
#variable student_count already gives us the total number of students

#calculate the percent who passed math
passing_math_percentage = passing_math_count/float(student_count) *100

#calculate the percent who passed reading
passing_reading_percentage = passing_reading_count/float(student_count)*100

print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [29]:
# 4.7.6: get % of students who passed both
#reuse the code, but add the & clause

passing_both = school_data_complete_df[(school_data_complete_df["math_score"]>=70) & (school_data_complete_df["reading_score"]>=70)]
# passing_both.head()
overall_pass_both = passing_both["student_name"].count()
overall_pass_both

25528

In [30]:
# 4.7.6: get percentages
# calculate the overall pass percentage
overall_passing_percentage = overall_pass_both/student_count*100
overall_passing_percentage

65.17232575950983

In [56]:
#4.7.7 Create a district summary data fram
#creating a new datafram means we need to create a list of dictionaries
# list of dictionaries is then converted into DF

district_summary_df = pd.DataFrame(
    [{"Total Schools": school_count,
        "Total Students": int(student_count),
        "Total Budget": int(total_budget),
        "Average Math Score": average_math_score,
        "Average Reading Score": average_reading_score,
        "% Passing Math": passing_math_percentage,
        "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [54]:
#format the total students to have a thousands separator
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [57]:
district_summary_df.dtypes

Total Schools              int64
Total Students             int64
Total Budget               int64
Average Math Score       float64
Average Reading Score    float64
% Passing Math           float64
% Passing Reading        float64
% Overall Passing        float64
dtype: object

In [34]:
#format Total Budget to have the comma for a thousands separator, a decimal and dollar sign

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [58]:
# Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [59]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,79.0,81.9,75,86,65

In [60]:
#4.7.9 reorder columns
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,79.0,81.9,75,86,65